; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v13)
             (pred_12 ?v10 ?v8)
             (pred_6 ?v2 ?v8)
             (pred_4 ?v6 ?v2 )
	     (pred_8 ?v2)
             (pred_9 ?v5)
             (pred_3 ?v10)
             (pred_2 ?v8)
             (pred_10 ?v2)
             (pred_5 ?v10)
             (pred_7 ?v2)
             (pred_1 ))



(:action op_2
:parameters (?v4 ?v12 ?v3 ?v11)
:precondition (and (pred_9 ?v4) (pred_9 ?v12) (pred_3 ?v3) (pred_2 ?v11)
          (pred_11 ?v4 ?v12) (pred_12 ?v3 ?v11)
                   (pred_6 ?v12 ?v11) (pred_8 ?v4) 
                   (pred_10 ?v12) (pred_5 ?v3))
:effect (and  (pred_7 ?v12) (not (pred_10 ?v12))))


(:action op_1
:parameters (?v4 ?v1)
:precondition (and (pred_9 ?v4) (pred_9 ?v1)
               (pred_8 ?v4) (pred_11 ?v4 ?v1) (pred_7 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_9 ?v4) (pred_3 ?v3) 
                  (pred_8 ?v4) (pred_4 ?v3 ?v4) (pred_1 ))
:effect (and (pred_5 ?v3)
   (not (pred_4 ?v3 ?v4)) (not (pred_1 ))))


(:action op_3
:parameters (?v4 ?v7 ?v9)
:precondition (and (pred_9 ?v4) (pred_3 ?v7) (pred_3 ?v9)
                  (pred_8 ?v4) (pred_5 ?v9) (pred_4 ?v7 ?v4))
:effect (and (pred_5 ?v7) (pred_4 ?v9 ?v4)
        (not (pred_5 ?v9)) (not (pred_4 ?v7 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_9 ?v4) (pred_3 ?v3) 
                  (pred_8 ?v4) (pred_5 ?v3))
:effect (and (pred_1 ) (pred_4 ?v3 ?v4) (not (pred_5 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_11 obj_12 obj_24 obj_15 obj_02 obj_29 obj_30 obj_31 obj_16 obj_27 obj_06 obj_20 obj_23 obj_19 obj_22 obj_08 obj_28 obj_07 obj_26 obj_10 obj_17 obj_32 obj_14 obj_01 obj_04
    obj_18 obj_05 obj_13
    obj_09 obj_03 obj_25 obj_21
    )

    (:init
       (pred_1)

       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_24)
       (pred_9 obj_15)
       (pred_9 obj_02)
       (pred_9 obj_29)
       (pred_9 obj_30)
       (pred_9 obj_31)
       (pred_9 obj_16)
       (pred_9 obj_27)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_22)
       (pred_9 obj_08)
       (pred_9 obj_28)
       (pred_9 obj_07)
       (pred_9 obj_26)
       (pred_9 obj_10)
       (pred_9 obj_17)
       (pred_9 obj_32)
       (pred_9 obj_14)
       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_3 obj_09)
       (pred_3 obj_03)
       (pred_3 obj_25)
       (pred_3 obj_21)

       (pred_11 obj_11 obj_29)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_24 obj_31)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_02 obj_27)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_29 obj_06)
       (pred_11 obj_29 obj_30)
       (pred_11 obj_29 obj_11)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_31)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_30 obj_29)
       (pred_11 obj_31 obj_23)
       (pred_11 obj_31 obj_16)
       (pred_11 obj_31 obj_24)
       (pred_11 obj_31 obj_30)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_27)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_16 obj_31)
       (pred_11 obj_27 obj_22)
       (pred_11 obj_27 obj_02)
       (pred_11 obj_27 obj_16)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_29)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_23 obj_07)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_31)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_19 obj_26)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_22 obj_10)
       (pred_11 obj_22 obj_27)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_28 obj_32)
       (pred_11 obj_28 obj_07)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_26)
       (pred_11 obj_07 obj_23)
       (pred_11 obj_07 obj_28)
       (pred_11 obj_26 obj_01)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_26 obj_19)
       (pred_11 obj_26 obj_07)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_22)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_17 obj_32)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_32 obj_14)
       (pred_11 obj_32 obj_28)
       (pred_11 obj_32 obj_17)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_14 obj_32)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_01 obj_26)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_04 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_24)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_6  obj_04 obj_18)
       (pred_6  obj_24 obj_05)
       (pred_6  obj_02 obj_13)
       (pred_6  obj_12 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_29)
       (pred_7 obj_30)
       (pred_7 obj_31)
       (pred_7 obj_16)
       (pred_7 obj_27)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_23)
       (pred_7 obj_19)
       (pred_7 obj_22)
       (pred_7 obj_08)
       (pred_7 obj_28)
       (pred_7 obj_07)
       (pred_7 obj_26)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_32)
       (pred_7 obj_14)
       (pred_7 obj_01)

       (pred_12  obj_09 obj_18)
       (pred_12  obj_03 obj_05)
       (pred_12  obj_25 obj_13)
       (pred_12  obj_21 obj_05)
       (pred_4 obj_09 obj_28)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_25 obj_22)
       (pred_4 obj_21 obj_29)
       (pred_8 obj_26)
    )

    (:goal (and
       (pred_4 obj_21 obj_19)
    ))
(:constraints
  (always (not (pred_8 obj_30)))
)
)

; plan
1. (op_1 obj_26 obj_19)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_23)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_23)
   goals met: 0 of 1
3. (op_1 obj_23 obj_20)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_20)
   goals met: 0 of 1
4. (op_1 obj_20 obj_06)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_29)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_29)
   goals met: 0 of 1
6. (op_5 obj_29 obj_21)
   deleted: (pred_4 obj_21 obj_29) (pred_1)
   added: (pred_5 obj_21)
   goals met: 0 of 1
7. (op_1 obj_29 obj_06)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_20)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_20)
   goals met: 0 of 1
9. (op_1 obj_20 obj_23)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_23)
   goals met: 0 of 1
10. (op_1 obj_23 obj_19)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_19)
   goals met: 0 of 1
11. (op_3 obj_19 obj_03 obj_21)
   deleted: (pred_5 obj_21) (pred_4 obj_03 obj_19)
   added: (pred_5 obj_03) (pred_4 obj_21 obj_19)
   goals met: 1 of 1
